In [1]:
import pandas

In [7]:
file=pandas.read_csv("data.csv")
file

     cooking time  fresh time
0              77   79.775152
1              21   23.177279
2              22   25.609262
3              20   17.857388
4              36   41.849864
..            ...         ...
295            71   68.545888
296            46   47.334876
297            55   54.090637
298            62   63.297171
299            47   52.459467

[300 rows x 2 columns]

In [12]:
file2=pandas.read_csv("aas.csv")
file2

      NAME  num1  num2
0    rahul    67    87
1   ramesh    89    35
2    danav     4   867
3   mahesh    23    32
4   hemant     8    64
5  dheeraj    56   332

In [8]:
file.dtypes    ## to see datatypes of each value in table in file

cooking time      int64
fresh time      float64
dtype: object

In [9]:
file.head(3)   ## 3 values from start of file

   cooking time  fresh time
0            77   79.775152
1            21   23.177279
2            22   25.609262

In [10]:
file.tail(3)   ## 3 values from end of file

     cooking time  fresh time
297            55   54.090637
298            62   63.297171
299            47   52.459467

In [13]:
file.describe()  ## if we want numerical values some calculated datas

       cooking time  fresh time
count    300.000000  300.000000
mean      50.936667   51.205051
std       28.504286   29.071481
min        0.000000   -3.467884
25%       27.000000   25.676502
50%       53.000000   52.170557
75%       73.000000   74.303007
max      100.000000  105.591837

In [14]:
file2.describe()

            num1        num2
count   6.000000    6.000000
mean   41.166667  236.166667
std    34.602986  328.992047
min     4.000000   32.000000
25%    11.750000   42.250000
50%    39.500000   75.500000
75%    64.250000  270.750000
max    89.000000  867.000000

In [15]:
file2.describe(include='all')  ## if we want to include string and other types of data to be calculated but makes no sense.

         NAME       num1        num2
count       6   6.000000    6.000000
unique      6        NaN         NaN
top     rahul        NaN         NaN
freq        1        NaN         NaN
mean      NaN  41.166667  236.166667
std       NaN  34.602986  328.992047
min       NaN   4.000000   32.000000
25%       NaN  11.750000   42.250000
50%       NaN  39.500000   75.500000
75%       NaN  64.250000  270.750000
max       NaN  89.000000  867.000000

In [16]:
file.info() ## to see total rows column and if any is null

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cooking time  300 non-null    int64
 1   fresh time    300 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 4.8 KB

In [22]:
file['fresh time'].min()

-3.467883789

In [20]:
file['cooking time'].max()   ## can also use functions like mean and std etc...

100

In [28]:
file['fresh time'].quantile(.25)  ## percentile

25.6765022375

In [31]:
file2['NAME'].unique()  ## tells all unique values in column can be used for numerical values too.

array(['rahul', 'ramesh', 'danav', 'mahesh', 'hemant', 'dheeraj'],
      dtype=object)

In [32]:
import numpy as np

In [33]:
np.std(file['cooking time'])

28.456738901161682

In [35]:
file['cooking time'].std()

28.504285699399638

In [36]:
np.std(file['cooking time'])-file['cooking time'].std()    
## there will be difference in calculations as they both use different formulas

-0.04754679823795627

In [37]:
np.std(file['cooking time'],ddof=1)
## to get same results as by python internal function file['cooking time'].std()  , ddof = degree of freedom

28.504285699399638